src/integration/lib/src/test/java/se/tink/backend/aggregation/agents/resources/test-refresh-traffic.aap

# Some comments to inform users, one can write here what dummy user name and password
# should be used or basically just write the purose of this file etc

REQUEST 1
POST https://global.americanexpress.com/mobileone/msl/services/transactions/v1/getDetails
Accept: application/json
X-Aggregator: Tink Testing

{"billingIndexList":[0],"sortedIndex":0}

RESPONSE 1 SET STATE1
200
Content-Type: application/json;charset=utf-8
Cache-Control: private, no-store, no-cache, must-revalidate

{}

REQUEST 2 MATCH STATE1
POST https://global.americanexpress.com/mobileone/msl/services/accountservicing/v1/extendSession
Accept: application/json
X-Aggregator: Tink Testing

RESPONSE 2
200
Content-Type: application/json;charset=utf-8
Cache-Control: private, no-store, no-cache, must-revalidate

{"extendSession":{"status":0}}

REQUEST 3
POST https://www.bsan.mobi/SANMOV_IPAD_NSeg_ENS/ws/SANMOV_Def_Listener
SOAPAction: https://www.bsan.mobi/SANMOV_IPAD_NSeg_ENS/ws/SANMOV_Def_Listener
Content-Type: text/xml; charset=utf-8

<v:Envelope xmlns:v="http://schemas.xmlsoap.org/soap/envelope/" xmlns:c="http://schemas.xmlsoap.org/soap/encoding/" xmlns:d="http://www.w3.org/2001/XMLSchema" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><v:Header /><v:Body><n0:authenticateCredential xmlns:n0="http://www.isban.es/webservices/TECHNICAL_FACADES/Security/F_facseg_security/internet/loginServicesNSegSAN/v1" facade="loginServicesNSegSAN"><CB_AuthenticationData i:type=":CB_AuthenticationData"><documento i:type=":documento"><CODIGO_DOCUM_PERSONA_CORP i:type="d:string">12345678</CODIGO_DOCUM_PERSONA_CORP><TIPO_DOCUM_PERSONA_CORP i:type="d:string">N</TIPO_DOCUM_PERSONA_CORP></documento><password i:type="d:string">hunter2</password></CB_AuthenticationData><userAddress i:type="d:string">127.0.0.1</userAddress></n0:authenticateCredential></v:Body></v:Envelope>

RESPONSE 3
200
Content-Type: text/xml;charset=UTF-8

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soap-env:Header/>
<soap-env:Body>
<prefixRigel0:authenticateCredentialResponse xmlns:prefixRigel0="http://www.isban.es/webservices/SBAMOV/Services_la/F_sbamov_services_la/internet/loginServicesNew/v1">
<methodResult>
<tokenCredential>aaaaaaaa-aaaa-4000-aaaa-aaaaaaaaaaaa</tokenCredential>
</methodResult>
</prefixRigel0:authenticateCredentialResponse>
</soap-env:Body>
</soap-env:Envelope>

REQUEST 4
GET https://global.americanexpress.com/mobileone/msl/services/accountservicing/v1/list
Accept: application/json
X-Aggregator: Tink Testing

RESPONSE 4 FAULT MALFORMED_RESPONSE_CHUNK
